gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
//* *******************************************************************
//   Webserver
//
//   How it all works together:
//
//   page   0.htm         includes javascript j.js
//   script j.js          the javascript requests the JSON
//          json          returns data as JSON
//   css    f.css         css for all on flash (program) memory
//   php                  not really php - only a resource doing actions and not returning content (just http header 204 ok)
//   ***************************************************************** */
//

#include <Arduino.h>
#include <timeserver.h>
#include <waterlevel_defines.h>
#include <waterlevel.h>

#ifdef ARDUINO_ARCH_ESP32
  // for Send-Mail
  // #include <ESP_Mail_Client.h>

  #include <WiFi.h>
  #include <WiFiClient.h>
  #include <WebServer.h>
  #include <ESPmDNS.h>

  //WebServer server(80); // an instance for the webserver
  extern WebServer server; // declare an instance for the webserver

#else // BOARDTYPE == ESP8266)
  // for Send-Mail
  #include <ESP_Mail_Client.h>

  #include <ESP8266WiFi.h>
  #include <WiFiClient.h>
  #include <ESP8266WebServer.h>  // for the webserver
  #include <ESP8266HTTPClient.h> // for the webclient https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266HTTPClient
  #include <ESP8266mDNS.h>       // Bonjour/multicast DNS, finds the device on network by name
  #include <ArduinoOTA.h>        // OTA Upload via ArduinoIDE

  #include <NTPClient.h> // get time from timeserver
  #include <WiFiUdp.h>

  ESP8266WebServer server(80); // an instance for the webserver

#endif

int val_AHH;
int val_AH;
int val_AL;
// int val_ALL;

int simVal_AHH = 0;
int simVal_AH  = 0;
int simVal_AL  = 0;
// int simVal_ALL = 0;

int firstRun = 1;

int debugLevelSwitches=0;

// void handleRoot() {
//   digitalWrite(builtin_led, 1);
//   char temp[400];
//   int sec = millis() / 1000;
//   int min = sec / 60;
//   int hr = min / 60;

//   snprintf(temp, 400,

//            "<html>\
//   <head>\
//     <meta http-equiv='refresh' content='5'/>\
//     <title>ESP32 Demo</title>\
//     <style>\
//       body { background-color: #cccccc; font-family: Arial, Helvetica, Sans-Serif; Color: #000088; }\
//     </style>\
//   </head>\
//   <body>\
//     <h1>Hello from ESP32!</h1>\
//     <p>Uptime: %02d:%02d:%02d</p>\
//     <img src=\"/test.svg\" />\
//   </body>\
// </html>",

//            hr, min % 60, sec % 60
//           );
//   server.send(200, "text/html", temp);
//   digitalWrite(builtin_led, 0);
// }

/* =======================================*/
void handleNotFound() {
/* =======================================*/
  // digitalWrite(builtin_led, 1);
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";

  for (uint8_t i = 0; i < server.args(); i++) {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }

  server.send(404, "text/plain", message);
  // digitalWrite(builtin_led, 0);
}

// void drawGraph() {
//   String out = "";
//   char temp[100];
//   out += "<svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" width=\"400\" height=\"150\">\n";
//   out += "<rect width=\"400\" height=\"150\" fill=\"rgb(250, 230, 210)\" stroke-width=\"1\" stroke=\"rgb(0, 0, 0)\" />\n";
//   out += "<g stroke=\"black\">\n";
//   int y = rand() % 130;
//   for (int x = 10; x < 390; x += 10) {
//     int y2 = rand() % 130;
//     sprintf(temp, "<line x1=\"%d\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke-width=\"1\" />\n", x, 140 - y, x + 10, 140 - y2);
//     out += temp;
//     y = y2;
//   }
//   out += "</g>\n</svg>\n";

//   server.send(200, "image/svg+xml", out);
// }

// /* =======================================*/
// void handleNotFound()
// {
//   /* =======================================*/
//   // Output a "404 not found" page. It includes the parameters which comes handy for test purposes.
//   Serial.println(F("D015 handleNotFound()"));
//   String message;
//   message += F("404 - File Not Found\n"
//                "URI: ");
//   message += server.uri();
//   message += F("\nMethod: ");
//   message += (server.method() == HTTP_GET) ? "GET" : "POST";
//   message += F("\nArguments: ");
//   message += server.args();
//   message += F("\n");
//   for (uint8_t i = 0; i < server.args(); i++)
//   {
//     message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
//   }
//   server.send(404, "text/plain", message);
// }

// /* =======================================*/
// void handle204()
// /* =======================================*/
// {
//   server.send(204); // this page doesn't send back content
// }

/* =======================================*/
/* add a header  to each page including refs for all other pages */
void addTop(String &message)
/* =======================================*/
{
  message = F("<!DOCTYPE html>"
              "<html lang='en'>"
              "<head>"
              "<title>Wasserstand-Messung</title>"
              "<meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\">"
              "<meta name=\"viewport\" content=\"width=device-width\">"
              "<link rel='stylesheet' type='text/css' href='/f.css'>"
              "<script src='j.js'></script>"
              "</head>");
  message += F("<body>");
  message += F("<header><h1>" TXT_BOARDNAME " - Board " TXT_BOARDID "</h1>");
  message += F("<nav> <a href=\"/\">[Home]</a> <a href=\"filtered.htm\">[Value History]</a>" 
               "<a href=\"longterm_graph.htm\">[Longterm Graph]</a>" "<a href=\"graph.htm\">[Shorterm Graph]</a> </nav></header>"
               "<main>");
}

/* =======================================*/
/* The footer will display the uptime, the IP-address the version of the sketch and the compile date/time */
/* add code to calculate the uptime */
void addBottom(String &message)
{
  /* =======================================*/

  message += F("</main>"
               "<footer><p>");
  message += F("<p>Actual Date and Time: ");

  message += currentDate;
  message += F(" -- ");
  message += formattedTime;
  message += F("<br>");

  if (seconds_since_startup > 604800)
  {
    message += F("<span id='week'>");
    message += ((seconds_since_startup / 604800) % 52);
    message += F("</span> weeks ");
  }
  if (seconds_since_startup > 86400)
  {
    message += F("<span id='day'>");
    message += ((seconds_since_startup / 86400) % 7);
    message += F("</span> days ");
  }
  if (seconds_since_startup > 3600)
  {
    message += F("<span id='hour'>");
    message += ((seconds_since_startup / 3600) % 24);
    message += F("</span> hours ");
  }

  message += F("<span id='min'>");
  message += ((seconds_since_startup / 60) % 60);
  message += F("</span> minutes ");

  message += F("<span id='sec'>");
  message += (seconds_since_startup % 60);
  message += F("</span> seconds since startup | Version " VERSION " | IP: ");
  message += WiFi.localIP().toString();
  message += F(" | " __DATE__ " " __TIME__ "</p></footer></body></html>");
  server.send(200, "text/html", message);
}

// the html output
// finally check your output if it is valid html: https://validator.w3.org
// *** HOME ***  0.htm
/* =======================================*/
/* main page of this application:
 *   - display water level as raw data
 *   - diaplay actual warn or alarm satus
 */
void handlePage()
/* =======================================*/
{
  String message;
  addTop(message);

  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" // here you write your html code for your homepage. Let's give some examples...
               "<p>Hier kann man den aktuellen Wasserstand in der Regenwasser-Zisterne  "
               "von Georg Zehentner, Streiblweg 19, Teisendorf ablesen.<br> "
               " Bei Überschreiten des Höchststand muss eine Pumpe aktiviert werden</p>"
               "</article>");

  message += F("<article>"
               "<h2>Rohdaten</h2><pre>");

  // input signals are low active
  message += F("Level Alarm   high: <span id='val_AHH'>");
  if (val_AHH == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  message += F("Level Warning high: <span id='val_AH' >");
  if (val_AH == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  message += F("Level Warning low:  <span id='val_AL' >");
  if (val_AL == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  // message += F("Level Alarm   low:  <span id='val_ALL'>");
  // if (val_ALL == 0)
  // {
  //   message += F("active");
  // }
  // else
  // {
  //   message += F("--");
  // }
  // message += F("</span><br>");
  message += F("</pre></article>");

  message += F("<article>"
               "<h2>Auswertung Wasserstand</h2>");
  if (alarmState == 5)
  {
    message += F("<message_err> Achtung Hochwasser -- Pumpe einschalten <br>Wasserstand &gt ");
    message += Level_AHH;
    message += F("<br></message_err>");
  }
  else if (alarmState == 4)
  {
    message += F("<message_warn> Wasserstand ist zwischen ");
    message += Level_AH;
    message += F(" und ");
    message += Level_AHH;
    message += F("<br></message_warn>");
  }
  else if (alarmState == 3)
  {
    message += F("<message_ok> Wasserstand ist zwischen ");
    message += Level_AL;
    message += F(" und ");
    message += Level_AH;
    message += F("<br></message_ok>");
  }
  else if (alarmState == 2)
  {
    message += F("<message_ok>   Wasserstand &lt; ");
    // message += F("<message_ok> Wasserstand ist zwischen ");
    // message += Level_ALL;
    // message += F(" und ");
    message += Level_AL;

    message += F("<br></message_ok>");
  }
  // else if (alarmState == 1)
  // {
  //   message += F("<message_ok>   Wasserstand &lt; ");
  //   message += Level_ALL;
  //   message += F("<br></message_ok>");
  // }

